## code for loading and creating subsets from the data

In [2]:
import pandas as pd

In [3]:
housing_df = pd.read_csv("/Users/JAE111/Sook-Tat/data_mining/dmba-datasets/WestRoxbury.csv")

In [7]:
housing_df.shape

(5802, 14)

In [8]:
housing_df.head()

,TOTAL VALUE,TAX,LOT SQFT,YR BUILT,GROSS AREA,LIVING AREA,FLOORS,ROOMS,BEDROOMS,FULL BATH,HALF BATH,KITCHEN,FIREPLACE,REMODEL
0,344.2,4330,9965,1880,2436,1352,2.0,6,3,1,1,1,0,None
1,412.6,5190,6590,1945,3108,1976,2.0,10,4,2,1,1,0,Recent
2,330.1,4152,7500,1890,2294,1371,2.0,8,4,1,1,1,0,None
3,498.6,6272,13773,1957,5032,2608,1.0,9,5,1,1,1,1,None
4,331.5,4170,5000,1910,2370,1438,2.0,7,3,2,0,1,0,None

In [9]:
print(housing_df)

      TOTAL VALUE    TAX  LOT SQFT   YR BUILT  GROSS AREA   LIVING AREA  \
0            344.2  4330       9965      1880         2436         1352
1            412.6  5190       6590      1945         3108         1976
2            330.1  4152       7500      1890         2294         1371
3            498.6  6272      13773      1957         5032         2608
4            331.5  4170       5000      1910         2370         1438
...            ...   ...        ...       ...          ...          ...
5797         404.8  5092       6762      1938         2594         1714
5798         407.9  5131       9408      1950         2414         1333
5799         406.5  5113       7198      1987         2480         1674
5800         308.7  3883       6890      1946         2000         1000
5801         447.6  5630       7406      1950         2510         1600

      FLOORS   ROOMS  BEDROOMS   FULL BATH  HALF BATH  KITCHEN  FIREPLACE  \
0         2.0      6          3          1          1        1          0
1         2.0     10          4          2          1        1          0
2         2.0      8          4          1          1        1          0
3         1.0      9          5          1          1        1          1
4         2.0      7          3          2          0        1          0
...       ...    ...        ...        ...        ...      ...        ...
5797      2.0      9          3          2          1        1          1
5798      2.0      6          3          1          1        1          1
5799      2.0      7          3          1          1        1          1
5800      1.0      5          2          1          0        1          0
5801      2.0      7          3          1          1        1          1

     REMODEL
0       None
1     Recent
2       None
3       None
4       None
...      ...
5797  Recent
5798    None
5799    None
5800    None
5801    None

[5802 rows x 14 columns]

In [7]:
# Rename columns: replace spaces with ’_’ to allow dot notation

housing_df = housing_df.rename(columns = {'TOTAL VALUE ' : 'TOTAL_VALUE'}) # explicit
housing_df.head(0)

Empty DataFrame
Columns: [TOTAL_VALUE, TAX, LOT SQFT , YR BUILT, GROSS AREA , LIVING AREA, FLOORS , ROOMS, BEDROOMS , FULL BATH, HALF BATH, KITCHEN, FIREPLACE, REMODEL]
Index: []

In [8]:
housing_df.columns = [s.strip().replace(' ', '_') for s in housing_df.columns] # all columns
# string.strip() : 해당 함수는 문자열 양 끝에 있는 공백을 제거해주고, 공백을 제거한 > 새로운 문자열을 반환 < 합니다.

housing_df.head(0)

Empty DataFrame
Columns: [TOTAL_VALUE, TAX, LOT_SQFT, YR_BUILT, GROSS_AREA, LIVING_AREA, FLOORS, ROOMS, BEDROOMS, FULL_BATH, HALF_BATH, KITCHEN, FIREPLACE, REMODEL]
Index: []

In [9]:
# Practicing showing the first four rows of the data

housing_df.loc[0:3] # loc[a:b] gives rows a to b, inclusive

,TOTAL_VALUE,TAX,LOT_SQFT,YR_BUILT,GROSS_AREA,LIVING_AREA,FLOORS,ROOMS,BEDROOMS,FULL_BATH,HALF_BATH,KITCHEN,FIREPLACE,REMODEL
0,344.2,4330,9965,1880,2436,1352,2.0,6,3,1,1,1,0,None
1,412.6,5190,6590,1945,3108,1976,2.0,10,4,2,1,1,0,Recent
2,330.1,4152,7500,1890,2294,1371,2.0,8,4,1,1,1,0,None
3,498.6,6272,13773,1957,5032,2608,1.0,9,5,1,1,1,1,None

In [7]:
housing_df.iloc[0:4] #iloc[a:b] gives a to (b-1)

,TOTAL_VALUE,TAX,LOT_SQFT,YR_BUILT,GROSS_AREA,LIVING_AREA,FLOORS,ROOMS,BEDROOMS,FULL_BATH,HALF_BATH,KITCHEN,FIREPLACE,REMODEL
0,344.2,4330,9965,1880,2436,1352,2.0,6,3,1,1,1,0,None
1,412.6,5190,6590,1945,3108,1976,2.0,10,4,2,1,1,0,Recent
2,330.1,4152,7500,1890,2294,1371,2.0,8,4,1,1,1,0,None
3,498.6,6272,13773,1957,5032,2608,1.0,9,5,1,1,1,1,None

In [8]:
# Different ways of showing the first 10 values in column TOTAL_VALUE

housing_df['TOTAL_VALUE'].iloc[0:10]

0    344.2
1    412.6
2    330.1
3    498.6
4    331.5
5    337.4
6    359.4
7    320.4
8    333.5
9    409.4
Name: TOTAL_VALUE, dtype: float64

In [10]:
housing_df.iloc[0:10]['TOTAL_VALUE'] # 뒤에 해도 동일

0    344.2
1    412.6
2    330.1
3    498.6
4    331.5
5    337.4
6    359.4
7    320.4
8    333.5
9    409.4
Name: TOTAL_VALUE, dtype: float64

In [11]:
housing_df.iloc[0:10].TOTAL_VALUE 
# use dot notation if the column name has no spaces (변수이름에 공백이 없을 경우 . 사용)

0    344.2
1    412.6
2    330.1
3    498.6
4    331.5
5    337.4
6    359.4
7    320.4
8    333.5
9    409.4
Name: TOTAL_VALUE, dtype: float64

In [12]:
# Show the fifth row of the first 10 columns

housing_df.iloc[4][0:10] # 0:10 열의 4번째 행

TOTAL_VALUE    331.5
TAX             4170
LOT_SQFT        5000
YR_BUILT        1910
GROSS_AREA      2370
LIVING_AREA     1438
FLOORS           2.0
ROOMS              7
BEDROOMS           3
FULL_BATH          2
Name: 4, dtype: object

In [13]:
housing_df.iloc[4, 0:10]

TOTAL_VALUE    331.5
TAX             4170
LOT_SQFT        5000
YR_BUILT        1910
GROSS_AREA      2370
LIVING_AREA     1438
FLOORS           2.0
ROOMS              7
BEDROOMS           3
FULL_BATH          2
Name: 4, dtype: object

In [14]:
housing_df.iloc[4:5, 0:10] 
# use a slice to return a data frame ( ':' 사용하면 데이터프레임 형식으로 나옴)

,TOTAL_VALUE,TAX,LOT_SQFT,YR_BUILT,GROSS_AREA,LIVING_AREA,FLOORS,ROOMS,BEDROOMS,FULL_BATH
4,331.5,4170,5000,1910,2370,1438,2.0,7,3,2

In [15]:
# Use pd.concat to combine non-consecutive columns into a new data frame
# The axis argumnet specifies the dimension along which the concatenation happens / 0 = rows, 1 = columns

pd.concat([housing_df.iloc[4:6, 0:2], housing_df.iloc[4:6, 4:6]], axis = 1)

   TOTAL_VALUE   TAX  GROSS_AREA  LIVING_AREA
4        331.5  4170        2370         1438
5        337.4  4244        2124         1060

In [19]:
# To specify a full column, use:

housing_df.iloc[:, 0:1]

      TOTAL_VALUE
0           344.2
1           412.6
2           330.1
3           498.6
4           331.5
...           ...
5797        404.8
5798        407.9
5799        406.5
5800        308.7
5801        447.6

[5802 rows x 1 columns]

In [20]:
housing_df.TOTAL_VALUE

0       344.2
1       412.6
2       330.1
3       498.6
4       331.5
        ...
5797    404.8
5798    407.9
5799    406.5
5800    308.7
5801    447.6
Name: TOTAL_VALUE, Length: 5802, dtype: float64

In [21]:
housing_df['TOTAL_VALUE'][0:10] # show the first 10 rows of the first column

0    344.2
1    412.6
2    330.1
3    498.6
4    331.5
5    337.4
6    359.4
7    320.4
8    333.5
9    409.4
Name: TOTAL_VALUE, dtype: float64

In [27]:
# Description statistics

print('Number of rows', len(housing_df['TOTAL_VALUE'])) # show length of first column
print('Mean of TOTAL_VALUE ', housing_df['TOTAL_VALUE'].mean()) # show mean of column
housing_df.describe() # show summary statistics of each column

Number of rows 5802
Mean of TOTAL_VALUE  392.6857149258885

,TOTAL_VALUE,TAX,LOT_SQFT,YR_BUILT,GROSS_AREA,LIVING_AREA,FLOORS,ROOMS,BEDROOMS,FULL_BATH,HALF_BATH,KITCHEN,FIREPLACE
count,5802.000000,5802.000000,5802.000000,5802.000000,5802.000000,5802.000000,5802.000000,5802.000000,5802.000000,5802.000000,5802.000000,5802.00000,5802.000000
mean,392.685715,4939.485867,6278.083764,1936.744916,2924.842123,1657.065322,1.683730,6.994829,3.230093,1.296794,0.613926,1.01534,0.739917
std,99.177414,1247.649118,2669.707974,35.989910,883.984726,540.456726,0.444884,1.437657,0.846607,0.522040,0.533839,0.12291,0.565108
min,105.000000,1320.000000,997.000000,0.000000,821.000000,504.000000,1.000000,3.000000,1.000000,1.000000,0.000000,1.00000,0.000000
25%,325.125000,4089.500000,4772.000000,1920.000000,2347.000000,1308.000000,1.000000,6.000000,3.000000,1.000000,0.000000,1.00000,0.000000
50%,375.900000,4728.000000,5683.000000,1935.000000,2700.000000,1548.500000,2.000000,7.000000,3.000000,1.000000,1.000000,1.00000,1.000000
75%,438.775000,5519.500000,7022.250000,1955.000000,3239.000000,1873.750000,2.000000,8.000000,4.000000,2.000000,1.000000,1.00000,1.000000
max,1217.800000,15319.000000,46411.000000,2011.000000,8154.000000,5289.000000,3.000000,14.000000,9.000000,5.000000,3.000000,2.00000,4.000000

## import required functionality for this chapter

In [28]:
import numpy as np
import pandas as pd
from sklearn.model_selection import train_test_split
from sklearn.metrics import r2_score
from sklearn.linear_model import LinearRegression

## code for sampling and over/under-sampling

In [31]:
# 'random' sample of 5 observations

housing_df.sample(5)

,TOTAL_VALUE,TAX,LOT_SQFT,YR_BUILT,GROSS_AREA,LIVING_AREA,FLOORS,ROOMS,BEDROOMS,FULL_BATH,HALF_BATH,KITCHEN,FIREPLACE,REMODEL
7,320.4,4030,10000,1950,2208,1200,1.0,6,3,1,0,1,0,None
1142,272.6,3429,3684,1969,2008,984,1.0,5,3,1,0,1,0,None
734,281.8,3545,4301,1954,2432,1306,1.5,6,3,1,1,1,1,None
1295,326.9,4112,4163,1961,3019,1586,1.5,7,3,1,1,1,0,None
1742,308.9,3885,4940,1875,2364,1492,2.0,5,2,1,1,1,0,None

In [10]:
# oversample houses with over 10 ROOMS (= ROOMS가 10개가 넘는 집을 oversampling 하자)
# * oversampling : 데이터 수가 적은 경우, 같은 데이터를 뻥튀기 해서 늘리는 것

weights = [0.9 if rooms > 10 else 0.01 for rooms in housing_df.ROOMS]
housing_df.sample(5, weights = weights) # weights 옵션 : 가중치

,TOTAL_VALUE,TAX,LOT_SQFT,YR_BUILT,GROSS_AREA,LIVING_AREA,FLOORS,ROOMS,BEDROOMS,FULL_BATH,HALF_BATH,KITCHEN,FIREPLACE,REMODEL
1630,383.3,4821,6036,1935,3029,1580,1.5,7,3,1,1,1,0,Recent
1467,773.5,9730,7449,2004,6960,3929,2.0,12,4,5,0,1,1,None
2849,526.3,6620,10000,1906,4392,2806,2.5,11,5,2,0,1,1,None
2455,597.3,7514,6900,1919,5243,2926,2.0,14,6,3,1,1,3,Old
684,234.0,2943,3738,1928,1694,1148,1.5,6,3,1,0,1,0,None

## code for reviewing variables

In [35]:
housing_df.columns # print a list of variables

Index(['TOTAL_VALUE', 'TAX', 'LOT_SQFT', 'YR_BUILT', 'GROSS_AREA',
       'LIVING_AREA', 'FLOORS', 'ROOMS', 'BEDROOMS', 'FULL_BATH', 'HALF_BATH',
       'KITCHEN', 'FIREPLACE', 'REMODEL'],
      dtype='object')

In [39]:
# REMODEL needs to be converted to a categorical variable

housing_df.REMODEL = housing_df.REMODEL.astype('category')
housing_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5802 entries, 0 to 5801
Data columns (total 14 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   TOTAL_VALUE  5802 non-null   float64
 1   TAX          5802 non-null   int64
 2   LOT_SQFT     5802 non-null   int64
 3   YR_BUILT     5802 non-null   int64
 4   GROSS_AREA   5802 non-null   int64
 5   LIVING_AREA  5802 non-null   int64
 6   FLOORS       5802 non-null   float64
 7   ROOMS        5802 non-null   int64
 8   BEDROOMS     5802 non-null   int64
 9   FULL_BATH    5802 non-null   int64
 10  HALF_BATH    5802 non-null   int64
 11  KITCHEN      5802 non-null   int64
 12  FIREPLACE    5802 non-null   int64
 13  REMODEL      5802 non-null   category
dtypes: category(1), float64(2), int64(11)
memory usage: 595.2 KB

In [41]:
housing_df.REMODEL.cat.categories # show number of categories

Index(['None', 'Old', 'Recent'], dtype='object')

In [44]:
housing_df.REMODEL.dtype # Check type of converted variable : CategoricalDtype

CategoricalDtype(categories=['None', 'Old', 'Recent'], ordered=False)

## code for creating binary dummies (indicators)

In [11]:
# use drop_first = True to drop the first dummy variable

housing_df = pd.get_dummies(housing_df, prefix_sep = '_', drop_first = True)
housing_df.columns # REMODEL_Old, REMODEL_Recent (None은 사용하지 않는다. / n-1개의 가변수 사용.)

Index(['TOTAL_VALUE', 'TAX', 'LOT_SQFT', 'YR_BUILT', 'GROSS_AREA',
       'LIVING_AREA', 'FLOORS', 'ROOMS', 'BEDROOMS', 'FULL_BATH', 'HALF_BATH',
       'KITCHEN', 'FIREPLACE', 'REMODEL_Old', 'REMODEL_Recent'],
      dtype='object')

In [12]:
housing_df.loc[:, 'REMODEL_Old' : "REMODEL_Recent"].head(5)

   REMODEL_Old  REMODEL_Recent
0            0               0
1            0               1
2            0               0
3            0               0
4            0               0

## code for imputing missing data with median

In [13]:
# To illustrate missing data procedure, we first convert a few entreis for bedrooms to NA's
# Then we impute missing values using the median of the remaining values.

missingRows = housing_df.sample(10).index 
missingRows

Int64Index([1055, 4869, 1410, 2903, 764, 5474, 4373, 4661, 1298, 4001], dtype='int64')

In [16]:
housing_df.loc[missingRows, 'BEDROOMS'] = np.nan
print('Number of rows with "valid" BEDROOMS values after setting to NAN :', housing_df['BEDROOMS'].count())

Number of rows with "valid" BEDROOMS values after setting to NAN : 5792

In [17]:
# remove rows with missing values

reduced_df = housing_df.dropna() # na 들어간 행을 삭제
print('Number of rows after removing rows with missing values :',len(reduced_df))

Number of rows after removing rows with missing values : 5792

In [18]:
# replace the missing values using the median of the remaining values.

medianBedrooms = housing_df['BEDROOMS'].median()
housing_df.BEDROOMS = housing_df.BEDROOMS.fillna(value = medianBedrooms)
print('Number of rows with valid BEDROOMS values after filling NA values :', housing_df['BEDROOMS'].count())

Number of rows with valid BEDROOMS values after filling NA values : 5802

## code for normailizing and rescaling a data frame

In [1]:
from sklearn.preprocessing import MinMaxScaler, StandardScaler

In [32]:
df = housing_df.copy()

StandardScaler() : 평균을 0, 분산을 1로 만듦 (정규화). 회귀보다는 '분류'에 사용

MinMaxScaler() : 특성들을 특정범위 (주로 [0,1])로 스케일링, 분류보다는 '회귀'에 사용

In [19]:
# Normalizing a data frame
# pandas:

norm_df = (housing_df - housing_df.mean()) / housing_df.std()

In [20]:
# scikit - learn :

scaler = StandardScaler() # creating a model
norm_df = pd.DataFrame(scaler.fit_transform(housing_df), index = housing_df.index, columns = housing_df.columns) # applying with the model
# the result of the transformation is a numpy array, we convert it into a dataframe

In [21]:
# Rescaling a data frame
# pandas :

norm_df = (housing_df - housing_df.min()) / (housing_df.max() - housing_df.min())
# (초기값 - 최소값) / (최대값 - 최소값)

In [25]:
# scikit - learn :

scaler = MinMaxScaler()
norm_df = pd.DataFrame(scaler.fit_transform(housing_df), index = housing_df.index, columns = housing_df.columns)

## code for partitioning the West Roxbury data into training, validation(검증) (and test) sets

In [35]:
# random_state is set to a defined value to get the same partitions when re-running (seed_number == random_state)
# the code

## partitioning into training (60%) and validation(40%) / test_size : 테스트 데이터셋의 비율(float)이나 갯수(int) 
# randomly sample 60% of the row IDs for training; the ramaining 40% serve as validation
trainData, validData = train_test_split(housing_df, test_size = 0.4, random_state = 1) 
print('Traning : ', trainData.shape)
print('Validattion : ', validData.shape)
print('\n')

## partitioning into training (50%), validation (30%), test (20%)
# randomly sample 50% of the row IDs for training
trainData, temp = train_test_split(housing_df, test_size = 0.5, random_state = 1) 
validData, testData = train_test_split(temp, test_size = 0.4, random_state = 1) 
# temp (50%) 에서 test set (50% * 40% -> 20%), validation set (50% * 60% -> 30%) 뽑음
print('Training  :', trainData.shape)
print('Validation:', validData.shape)
print('Test      :', testData.shape)

Traning :  (3481, 15)
Validattion :  (2321, 15)


Training  : (2901, 15)
Validation: (1740, 15)
Test      : (1161, 15)

## code for fitting a regression model to training data (West Roxbury)

In [13]:
import pandas as pd
import numpy as np
from sklearn.linear_model import LinearRegression
from sklearn.model_selection import train_test_split

In [4]:
# data loading and preprocessing

housing_df = pd.read_csv('WestRoxbury.csv')
housing_df.columns = [s.strip().replace(' ','_') for s in housing_df.columns]
housing_df.head(3)

,TOTAL_VALUE,TAX,LOT_SQFT,YR_BUILT,GROSS_AREA,LIVING_AREA,FLOORS,ROOMS,BEDROOMS,FULL_BATH,HALF_BATH,KITCHEN,FIREPLACE,REMODEL
0,344.2,4330,9965,1880,2436,1352,2.0,6,3,1,1,1,0,None
1,412.6,5190,6590,1945,3108,1976,2.0,10,4,2,1,1,0,Recent
2,330.1,4152,7500,1890,2294,1371,2.0,8,4,1,1,1,0,None

In [6]:
housing_df = pd.get_dummies(housing_df, prefix_sep = '_', drop_first = True)
housing_df.head(3)

,TOTAL_VALUE,TAX,LOT_SQFT,YR_BUILT,GROSS_AREA,LIVING_AREA,FLOORS,ROOMS,BEDROOMS,FULL_BATH,HALF_BATH,KITCHEN,FIREPLACE,REMODEL_Old,REMODEL_Recent
0,344.2,4330,9965,1880,2436,1352,2.0,6,3,1,1,1,0,0,0
1,412.6,5190,6590,1945,3108,1976,2.0,10,4,2,1,1,0,0,1
2,330.1,4152,7500,1890,2294,1371,2.0,8,4,1,1,1,0,0,0

In [7]:
# create list of predictors and outcome

excludeColumns = ('TOTAL_VALUE', 'TAX')
predictors = [s for s in housing_df.columns if s not in excludeColumns]
outcome = 'TOTAL_VALUE'

In [18]:
# partition data

x = housing_df[predictors]
y = housing_df[outcome]
train_x, valid_x, train_y, valid_y = train_test_split(x, y, test_size = 0.4, random_state = 1)
model = LinearRegression() 
model.fit(train_x, train_y) # 모델 적용
train_pred = model.predict(train_x) # 모델로 예측한 TOTAL_VALUE 값 
train_results = pd.DataFrame({'TOTAL_VALUE': train_y, 'predicted' : train_pred, 'residual' : train_y - train_pred})
# residual : 잔차
train_results.head()

      TOTAL_VALUE   predicted   residual
2024        392.0  387.726258   4.273742
5140        476.3  430.785540  45.514460
5259        367.4  384.042952 -16.642952
421         350.3  369.005551 -18.705551
1401        348.1  314.725722  33.374278

## code for applying the regression model to predict validation set (West Roxbury)

In [20]:
valid_pred = model.predict(valid_x) # training data로 구축한 모델을 적용해서 validation data 예측하기
valid_results = pd.DataFrame({
        'TOTAL_VALUE' : valid_y,
        'predicted' : valid_pred,
        'residual' : valid_y - valid_pred
})
valid_results.head()

      TOTAL_VALUE   predicted   residual
1822        462.0  406.946377  55.053623
1998        370.4  362.888928   7.511072
5126        407.4  390.287208  17.112792
808         316.1  382.470203 -66.370203
4034        393.2  434.334998 -41.134998

## code for computing model evaluation metrics (예측오차)

In [27]:
# import the utility function regressionSummary

from dmba import regressionSummary # 왜 안 되는......???????

ModuleNotFoundError: No module named 'dmba'